kylefoxaustin/qemu-imxrt1180/hw/misc/imxrt1180_ccm.c
/*
 * NXP i.MX RT1180 CCM — Clock Controller Module.
 *
 * THIS BLOCK USED TO BE A REGISTER FILE WEARING A CLOCK TREE'S NAME.  It stored
 * the MUX/DIV the guest wrote into CLOCK_ROOT[n].CONTROL and NOTHING DOWNSTREAM
 * EVER READ THEM.  Two consequences, and they are the same bug seen from both ends:
 *
 *   1. OBSERVE[].FREQUENCY_CURRENT returned a FABRICATED 6 MHz.  The guest's
 *      CLOCK_GetFreqFromObs() multiplies it by (CCM_OBS_DIV+1) and divides a baud
 *      rate by the result.  THE NUMBER LANDED IN THE GUEST'S ARITHMETIC.  The old
 *      source said so, honestly: "a consumer that needs an exact frequency is
 *      getting an approximation -- flagged here rather than presented as measured
 *      silicon."  THE FLAG WAS A C COMMENT.  FIRMWARE CANNOT READ C COMMENTS.
 *      CLAUDE.md has forbidden exactly this for months ("an out-of-band flag is not
 *      an honest fault") and the code did it anyway.
 *
 *   2. Every timer in the machine ticked at a hardcoded constant.  The SoC wired
 *      sysclk/refclk to the CPU and drove NOT ONE peripheral clock; six blocks each
 *      opened with `if (!s->clk) s->clk = DEFAULT;`, a fallback that made the
 *      missing wiring invisible.  Measured against what the SDK's own
 *      CLOCK_GetRootClockFreq() computes: GPT 10x slow, LPIT/TPM 5.5x slow, LPTMR
 *      3.3x slow, QTMR 1.8x fast, eFlexPWM 1.5x fast.  NOT ONE OF THE SIX MATCHED.
 *      (mcxn947qemu's OSTIMER, six times over: "a ?: is not a safety net, it is a
 *      place for a bug to live where no test will ever look.")
 *
 * So: COMPUTE IT.  CLAUDE.md rule 4 -- decline only what you genuinely cannot
 * produce, and a clock tree whose inputs are all in registers we already hold is
 * not something we cannot produce.
 *
 *   root_hz(n) = source_hz(MUX_TABLE[n][CONTROL.MUX]) / (CONTROL.DIV + 1)
 *
 * MUX_TABLE is s_clockSourceName[74][4] from fsl_clock.c -- a device fact, taken
 * mechanically from the SDK, not retyped.  The PLL/OSC frequencies are computed
 * from the ANADIG registers, the same arithmetic as CLOCK_GetPllFreq().
 *
 * Offsets/counts verified against the MIMXRT1189 CMSIS PERI_CCM.h.
 * Reset values are the RM's cold-POR column (the reset-value gate checks them).
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/misc/imxrt1180_ccm.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"

/* ---- Register geometry.  ALL of this is from PERI_CCM.h, none of it invented. */
#define CCM_ROOT_BASE          0x0000      /* CLOCK_ROOT[74], step 0x80          */
#define CCM_ROOT_STEP          0x80
#define CCM_ROOT_CONTROL       0x00
#define CCM_ROOT_STATUS0       0x20
#define CCM_ROOT_AUTHEN        0x30

#define CCM_OBS_BASE           0x4400      /* OBSERVE[2], step 0x80              */
#define CCM_OBS_STEP           0x80
#define CCM_OBS_COUNT          2
#define CCM_OBS_CONTROL        0x4400
#define CCM_OBS_AUTHEN         0x4430
#define CCM_OBS_FREQ_CURRENT   0x4440
#define CCM_OBS_FREQ_MIN       0x4444
#define CCM_OBS_FREQ_MAX       0x4448
#define CCM_OBS_PERIOD_MIN     0x4454
#define CCM_OBS_HIGH_MIN       0x4464
#define CCM_OBS_LOW_MIN        0x4474

#define CCM_GPR_PRIV_BASE      0x4C00      /* GPR_PRIVATE[4], step 0x20          */
#define CCM_GPR_PRIV_STEP      0x20
#define CCM_GPR_PRIV_COUNT     4
#define CCM_GPR_PRIV_AUTHEN    0x10        /* +SET/CLR/TOG at +0x14/0x18/0x1C    */

#define CCM_OSCPLL_BASE        0x5000      /* OSCPLL[25], step 0x40              */
#define CCM_OSCPLL_STEP        0x40
#define CCM_OSCPLL_COUNT       25
#define CCM_OSCPLL_DIRECT      0x00
#define CCM_OSCPLL_STATUS0     0x20
#define CCM_OSCPLL_STATUS1     0x24
#define CCM_OSCPLL_AUTHEN      0x30

#define CCM_LPCG_BASE          0x8000      /* LPCG[149], step 0x40               */
#define CCM_LPCG_STEP          0x40
#define CCM_LPCG_COUNT         149
#define CCM_LPCG_DIRECT        0x00
#define CCM_LPCG_STATUS0       0x20
#define CCM_LPCG_STATUS1       0x24
#define CCM_LPCG_AUTHEN        0x30

#define LPCG_ON                0x1u

/* CLOCK_ROOT[n].CONTROL fields (CCM_CLOCK_ROOT_CONTROL_{DIV,MUX}_MASK). */
#define ROOT_DIV_MASK          0xFFu
#define ROOT_MUX_SHIFT         8
#define ROOT_MUX_MASK          0x3u
#define ROOT_OFF               (1u << 24)  /* CONTROL.OFF: root gated off        */

/* OBSERVE[n].CONTROL: SELECT picks the observed clock; OFF gates the observer. */
#define OBS_SELECT_MASK        0x1FFu
#define OBS_OFF                (1u << 24)
#define OBS_DIV_MASK           0xFFu
#define OBS_DIV_SHIFT          16

/* ---- The clock sources a root MUX can select (fsl_clock.h clock_name_t). */
typedef enum {
    CLK_OSC_RC_24M, CLK_OSC_RC_400M, CLK_OSC_24M,
    CLK_ARM_PLL, CLK_AUDIO_PLL,
    CLK_SYS_PLL1, CLK_SYS_PLL1_DIV2, CLK_SYS_PLL1_DIV5,
    CLK_SYS_PLL2, CLK_SYS_PLL2_PFD0, CLK_SYS_PLL2_PFD1,
    CLK_SYS_PLL2_PFD2, CLK_SYS_PLL2_PFD3,
    CLK_SYS_PLL3, CLK_SYS_PLL3_DIV2, CLK_SYS_PLL3_PFD0,
    CLK_SYS_PLL3_PFD1, CLK_SYS_PLL3_PFD2, CLK_SYS_PLL3_PFD3,
} IMXRT1180ClkSrc;

/*
 * s_clockSourceName[74][4], fsl_clock.c.  Taken MECHANICALLY from the SDK: a
 * per-root mux table is a device fact and retyping 296 entries by hand is how you
 * fabricate one.  The row count is asserted below against CMSIS's
 * CCM_CLOCK_ROOT_COUNT -- a different file, parsed by a different tool.
 * (Generating it, the first pass silently produced 73 rows: the last entry has no
 * trailing comma and the regex skipped it.  A count from an independent source is
 * the only reason that did not become root 73 reading off the end of the table.)
 */
static const IMXRT1180ClkSrc ccm_root_mux[IMXRT1180_CCM_NROOT][4] = {
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_ARM_PLL      , CLK_SYS_PLL3      },  /*  0 M7 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3     , CLK_ARM_PLL       },  /*  1 M33 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1     , CLK_SYS_PLL2_PFD1 },  /*  2 EDGELOCK */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL2     , CLK_SYS_PLL3_PFD2 },  /*  3 BUS_AON */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL2     , CLK_SYS_PLL3_PFD1 },  /*  4 BUS_WAKEUP */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3     , CLK_SYS_PLL2_PFD1 },  /*  5 WAKEUP_AXI */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL1_DIV5 },  /*  6 SWO_TRACE */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_OSC_24M      , CLK_SYS_PLL3_DIV2 },  /*  7 M33_SYSTICK */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_OSC_24M      , CLK_SYS_PLL3_DIV2 },  /*  8 M7_SYSTICK */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL1_DIV5 },  /*  9 FLEXIO1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL1_DIV5 },  /* 10 FLEXIO2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 11 LPIT3 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 12 LPTIMER1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 13 LPTIMER2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 14 LPTIMER3 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 15 TPM2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 16 TPM4 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 17 TPM5 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 18 TPM6 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 19 GPT1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 20 GPT2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_PFD0, CLK_SYS_PLL2_PFD2 },  /* 21 FLEXSPI1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_PFD0, CLK_SYS_PLL2_PFD2 },  /* 22 FLEXSPI2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_PFD0, CLK_SYS_PLL2_PFD2 },  /* 23 FLEXSPI_SLV */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 24 CAN1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 25 CAN2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 26 CAN3 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 27 LPUART0102 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 28 LPUART0304 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 29 LPUART0506 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 30 LPUART0708 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 31 LPUART0910 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 32 LPUART1112 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 33 LPI2C0102 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 34 LPI2C0304 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 35 LPI2C0506 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 36 LPSPI0102 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 37 LPSPI0304 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 38 LPSPI0506 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 39 I3C1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 40 I3C2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 41 USDHC1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 42 USDHC2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 43 SEMC */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 44 ADC1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 45 ADC2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 46 ACMP */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 47 ECAT */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 48 ENET */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 49 TMR_1588 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 50 NETC */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 51 MAC0 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 52 MAC1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 53 MAC2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 54 MAC3 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 55 MAC4 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV2, CLK_SYS_PLL2_PFD1 },  /* 56 SERDES0 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV2, CLK_SYS_PLL2_PFD1 },  /* 57 SERDES1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV2, CLK_SYS_PLL2_PFD1 },  /* 58 SERDES2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 59 SERDES0_1G */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 60 SERDES1_1G */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_SYS_PLL2_PFD1 },  /* 61 SERDES2_1G */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 62 XCELBUSX */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 63 XRIOCU4 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL2_PFD3 },  /* 64 MCTRL */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_AUDIO_PLL    , CLK_SYS_PLL3_PFD2 },  /* 65 SAI1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_AUDIO_PLL    , CLK_SYS_PLL3_PFD2 },  /* 66 SAI2 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_AUDIO_PLL    , CLK_SYS_PLL3_PFD2 },  /* 67 SAI3 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_AUDIO_PLL    , CLK_SYS_PLL3_PFD2 },  /* 68 SAI4 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_AUDIO_PLL    , CLK_SYS_PLL3_PFD2 },  /* 69 SPDIF */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_AUDIO_PLL    , CLK_SYS_PLL3_PFD2 },  /* 70 ASRC */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_AUDIO_PLL     },  /* 71 MIC */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL3_DIV2, CLK_SYS_PLL1_DIV2 },  /* 72 CKO1 */
    { CLK_OSC_RC_24M   , CLK_OSC_RC_400M  , CLK_SYS_PLL1_DIV5, CLK_ARM_PLL       },  /* 73 CKO2 */
};

/* fsl_clock.h */
#define XTAL_FREQ          24000000u
#define PLL_SYS1_1G_FREQ   1000000000u
#define PLL_SYS2_528_FREQ  (XTAL_FREQ * 22u)   /* PLL_SYS2_528_MFI = 22 */
#define PLL_SYS3_480_FREQ  (XTAL_FREQ * 20u)   /* PLL_SYS3_480_MFI = 20 */

/* ANADIG_PLL, relative to the ANADIG window base. */
#define ANADIG_ARM_PLL_CTRL      0x4000
#define ANADIG_SYS_PLL3_PFD      0x4030
#define ANADIG_SYS_PLL2_PFD      0x4070
#define ARM_PLL_DIV_SELECT_MASK  0xFFu
#define ARM_PLL_POST_DIV_SHIFT   13
#define ARM_PLL_POST_DIV_MASK    0x7u
#define PFD_FRAC_MASK            0x3Fu

static uint32_t anadig_reg(IMXRT1180CCMState *s, hwaddr off)
{
    return s->anadig ? s->anadig->regs[off / 4] : 0;
}

