kylefoxaustin/qemu-imxrt1180/hw/misc/imxrt1180_ccm.c
/* CLOCK_GetPfdFreq(): pllFreq * 18 / frac.  frac == 0 means the PFD is off. */
static uint32_t ccm_pfd_hz(IMXRT1180CCMState *s, hwaddr pfd_reg,
                           uint32_t pll_hz, unsigned pfd)
{
    uint32_t frac = (anadig_reg(s, pfd_reg) >> (8 * pfd)) & PFD_FRAC_MASK;

    return frac ? (uint32_t)(((uint64_t)pll_hz * 18u) / frac) : 0;
}

/* CLOCK_GetPllFreq(kCLOCK_PllArm): XTAL / (2 * 2^(POST_DIV+1)) * DIV_SELECT. */
static uint32_t ccm_arm_pll_hz(IMXRT1180CCMState *s)
{
    uint32_t ctrl = anadig_reg(s, ANADIG_ARM_PLL_CTRL);
    uint32_t div_select = ctrl & ARM_PLL_DIV_SELECT_MASK;
    uint32_t post = (ctrl >> ARM_PLL_POST_DIV_SHIFT) & ARM_PLL_POST_DIV_MASK;

    return (uint32_t)(((uint64_t)XTAL_FREQ / (2ull << (post + 1))) * div_select);
}

static uint32_t ccm_src_hz(IMXRT1180CCMState *s, IMXRT1180ClkSrc src)
{
    switch (src) {
    case CLK_OSC_RC_24M:    return 24000000u;
    case CLK_OSC_RC_400M:   return 400000000u;
    case CLK_OSC_24M:       return XTAL_FREQ;
    case CLK_ARM_PLL:       return ccm_arm_pll_hz(s);
    case CLK_SYS_PLL1:      return PLL_SYS1_1G_FREQ;
    case CLK_SYS_PLL1_DIV2: return PLL_SYS1_1G_FREQ / 2;
    case CLK_SYS_PLL1_DIV5: return PLL_SYS1_1G_FREQ / 5;
    case CLK_SYS_PLL2:      return PLL_SYS2_528_FREQ;
    case CLK_SYS_PLL3:      return PLL_SYS3_480_FREQ;
    case CLK_SYS_PLL3_DIV2: return PLL_SYS3_480_FREQ / 2;

    case CLK_SYS_PLL2_PFD0: case CLK_SYS_PLL2_PFD1:
    case CLK_SYS_PLL2_PFD2: case CLK_SYS_PLL2_PFD3:
        return ccm_pfd_hz(s, ANADIG_SYS_PLL2_PFD, PLL_SYS2_528_FREQ,
                          src - CLK_SYS_PLL2_PFD0);

    case CLK_SYS_PLL3_PFD0: case CLK_SYS_PLL3_PFD1:
    case CLK_SYS_PLL3_PFD2: case CLK_SYS_PLL3_PFD3:
        return ccm_pfd_hz(s, ANADIG_SYS_PLL3_PFD, PLL_SYS3_480_FREQ,
                          src - CLK_SYS_PLL3_PFD0);

    case CLK_AUDIO_PLL:
        /* The audio PLL's fractional divider is not modelled.  Return 0 -- a
         * REFUSAL, not a number.  Callers must not divide by it, and no timer in
         * this machine selects it.  Answering "some plausible MHz" here is how the
         * fabricated 6 MHz got in.  ("Decline what you cannot produce"; the audio
         * path is honestly-open work, see PERIPHERALS.md.) */
        qemu_log_mask(LOG_UNIMP, "%s: AUDIO_PLL frequency not modelled; "
                      "reporting 0 (no frequency), not a guess\n", __func__);
        return 0;
    }
    return 0;
}

uint32_t imxrt1180_ccm_root_hz(IMXRT1180CCMState *s, unsigned root)
{
    uint32_t ctrl, div, hz;
    unsigned mux;

    if (root >= IMXRT1180_CCM_NROOT) {
        return 0;
    }
    ctrl = s->regs[(CCM_ROOT_BASE + root * CCM_ROOT_STEP + CCM_ROOT_CONTROL) / 4];
    if (ctrl & ROOT_OFF) {
        return 0;                       /* the guest gated this root off */
    }
    mux = (ctrl >> ROOT_MUX_SHIFT) & ROOT_MUX_MASK;
    div = (ctrl & ROOT_DIV_MASK) + 1;   /* the field holds DIV-1 */

    hz = ccm_src_hz(s, ccm_root_mux[root][mux]);
    return hz / div;
}

uint32_t imxrt1180_ccm_periph_hz(IMXRT1180CCMState *s, unsigned root,
                                 const char *dev)
{
    uint32_t hz = s ? imxrt1180_ccm_root_hz(s, root) : 0;

    if (!hz) {
        /* NOT a fallback.  The caller must not tick. */
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: clock root %u yields no frequency (gated off, or its "
                      "source is not modelled) -- the block has NO CLOCK and will "
                      "not run.  This is deliberate: a plausible default here is "
                      "how six timers ran at the wrong rate undetected.\n",
                      dev, root);
    }
    return hz;
}

/* ---- OBSERVE.  The block counts edges of the clock its SELECT field picks. */
static bool ccm_obs_slice(hwaddr off, unsigned reg, unsigned *slice)
{
    for (unsigned n = 0; n < CCM_OBS_COUNT; n++) {
        if (off == reg + n * CCM_OBS_STEP) {
            *slice = n;
            return true;
        }
    }
    return false;
}

/*
 * OBSERVE[n].SELECT indexes the observable-clock list.  Selectors 0..73 are the
 * clock ROOTS -- which is what CLOCK_GetFreqFromObs() uses and what we can
 * actually compute.  The remaining selectors observe raw OSC/PLL nodes and are
 * NOT modelled: they report 0.
 *
 * 0 IS THE RM's RESET VALUE AND IT IS AN HONEST "NOTHING MEASURED".  It is also
 * what the block reads before the guest starts it.  The old model returned a
 * hardcoded 6 MHz here unconditionally -- including at reset, where the manual
 * says 0 -- and the reset-value gate caught it as 0x005b8d80.
 */
static uint32_t ccm_obs_hz(IMXRT1180CCMState *s, unsigned slice)
{
    uint32_t ctrl = s->regs[(CCM_OBS_CONTROL + slice * CCM_OBS_STEP) / 4];
    uint32_t sel = ctrl & OBS_SELECT_MASK;
    uint32_t div = ((ctrl >> OBS_DIV_SHIFT) & OBS_DIV_MASK) + 1;

    if (ctrl & OBS_OFF) {
        return 0;                       /* observer not running: nothing measured */
    }
    if (sel >= IMXRT1180_CCM_NROOT) {
        qemu_log_mask(LOG_UNIMP, "%s: OBSERVE%u selects source %u (not a clock "
                      "root); this model can only measure roots, reporting 0\n",
                      __func__, slice, sel);
        return 0;
    }
    /* The observer divides what it counts; CLOCK_GetFreqFromObs multiplies back. */
    return imxrt1180_ccm_root_hz(s, sel) / div;
}

static uint64_t imxrt1180_ccm_read(void *opaque, hwaddr offset, unsigned size)
{
    IMXRT1180CCMState *s = IMXRT1180_CCM(opaque);
    unsigned slice;

    if (offset + 4 > IMXRT1180_CCM_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB read @0x%" HWADDR_PRIx "\n",
                      __func__, offset);
        return 0;
    }

    /* LPCG STATUS0.ON mirrors DIRECT.ON, so CLOCK_ControlGate's poll completes. */
    if (offset >= CCM_LPCG_BASE + CCM_LPCG_STATUS0 &&
        offset <  CCM_LPCG_BASE + CCM_LPCG_COUNT * CCM_LPCG_STEP &&
        ((offset - CCM_LPCG_BASE - CCM_LPCG_STATUS0) % CCM_LPCG_STEP) == 0) {
        unsigned gate = (offset - CCM_LPCG_BASE - CCM_LPCG_STATUS0) / CCM_LPCG_STEP;
        uint32_t direct = s->regs[(CCM_LPCG_BASE + gate * CCM_LPCG_STEP) / 4];
        return (direct & LPCG_ON) ? LPCG_ON : 0;
    }

