kylefoxaustin/qemu-imxrt1180/hw/misc/imxrt1180_ccm.c
    if (ccm_obs_slice(offset, CCM_OBS_FREQ_CURRENT, &slice)) {
        return ccm_obs_hz(s, slice);            /* COMPUTED, not fabricated */
    }

    return s->regs[offset / 4];
}

static void imxrt1180_ccm_write(void *opaque, hwaddr offset,
                                uint64_t value, unsigned size)
{
    IMXRT1180CCMState *s = IMXRT1180_CCM(opaque);

    if (offset + 4 > IMXRT1180_CCM_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR, "%s: OOB write @0x%" HWADDR_PRIx "\n",
                      __func__, offset);
        return;
    }
    s->regs[offset / 4] = value;
}

static const MemoryRegionOps imxrt1180_ccm_ops = {
    .read = imxrt1180_ccm_read,
    .write = imxrt1180_ccm_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 4,
    .valid.max_access_size = 4,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
};

/*
 * RESET.  A ZERO RESET VALUE IS NOT THE ABSENCE OF A CLAIM -- IT IS A CLAIM, AND
 * THE GUEST BELIEVES IT.  This block was a bare memset(regs, 0), which is 804
 * false statements about the silicon:
 *
 *   every LPCG gate and every OSCPLL says OFF at reset;   silicon says ON  (0x1)
 *   every AUTHEN says 0;                                  silicon says 0xffff0000
 *
 * Values are the RM's cold-POR reset column; offsets are from PERI_CCM.h.  The
 * reset-value gate checks all 804 independently, against a golden built by a
 * different tool from a different document.
 */
static void imxrt1180_ccm_reset(DeviceState *dev)
{
    IMXRT1180CCMState *s = IMXRT1180_CCM(dev);
    unsigned n;

    memset(s->regs, 0, sizeof(s->regs));

#define CCM_SET(off, val)  (s->regs[(off) / 4] = (val))

    for (n = 0; n < IMXRT1180_CCM_NROOT; n++) {
        hwaddr b = CCM_ROOT_BASE + n * CCM_ROOT_STEP;
        CCM_SET(b + CCM_ROOT_AUTHEN, 0xFFFF0000);
    }
    for (n = 0; n < CCM_OSCPLL_COUNT; n++) {
        hwaddr b = CCM_OSCPLL_BASE + n * CCM_OSCPLL_STEP;
        CCM_SET(b + CCM_OSCPLL_DIRECT,  0x00000001);   /* enabled out of reset */
        CCM_SET(b + CCM_OSCPLL_STATUS0, 0x00000001);
        CCM_SET(b + CCM_OSCPLL_STATUS1, 0x0000FFFF);
        CCM_SET(b + CCM_OSCPLL_AUTHEN,  0xFFFF0000);
    }
    for (n = 0; n < CCM_LPCG_COUNT; n++) {
        hwaddr b = CCM_LPCG_BASE + n * CCM_LPCG_STEP;
        CCM_SET(b + CCM_LPCG_DIRECT,  0x00000001);     /* gate ON out of reset */
        CCM_SET(b + CCM_LPCG_STATUS0, 0x00000001);
        CCM_SET(b + CCM_LPCG_STATUS1, 0x0000FFFF);
        CCM_SET(b + CCM_LPCG_AUTHEN,  0xFFFF0000);
    }
    for (n = 0; n < CCM_GPR_PRIV_COUNT; n++) {
        hwaddr b = CCM_GPR_PRIV_BASE + n * CCM_GPR_PRIV_STEP + CCM_GPR_PRIV_AUTHEN;
        CCM_SET(b + 0x0, 0xFFFF0000);                  /* AUTHEN            */
        CCM_SET(b + 0x4, 0xFFFF0000);                  /* AUTHEN_SET        */
        CCM_SET(b + 0x8, 0xFFFF0000);                  /* AUTHEN_CLR        */
        CCM_SET(b + 0xC, 0xFFFF0000);                  /* AUTHEN_TOG        */
    }
    /* GPR_SHARED_STATUS[8] @0x4A00, step 4 (PERI_CCM.h).  Two are non-zero. */
    CCM_SET(0x4A00 + 4 * 4, 0xFF000100);      /* GPR_SHARED_STATUS4 */
    CCM_SET(0x4A00 + 5 * 4, 0x00000007);      /* GPR_SHARED_STATUS5 */

    for (n = 0; n < CCM_OBS_COUNT; n++) {
        hwaddr b = n * CCM_OBS_STEP;
        CCM_SET(CCM_OBS_AUTHEN       + b + 0x0, 0xFFFF0000);
        CCM_SET(CCM_OBS_AUTHEN       + b + 0x4, 0xFFFF0000);
        CCM_SET(CCM_OBS_AUTHEN       + b + 0x8, 0xFFFF0000);
        CCM_SET(CCM_OBS_AUTHEN       + b + 0xC, 0xFFFF0000);
        /* The min-trackers start at their maxima so the first sample wins. */
        CCM_SET(CCM_OBS_FREQ_MIN     + b, 0xFFFFFFC0);
        CCM_SET(CCM_OBS_PERIOD_MIN   + b, 0xFFFFFFFF);
        CCM_SET(CCM_OBS_HIGH_MIN     + b, 0xFFFFFFFF);
        CCM_SET(CCM_OBS_LOW_MIN      + b, 0xFFFFFFFF);
    }
#undef CCM_SET
}

static void imxrt1180_ccm_realize(DeviceState *dev, Error **errp)
{
    IMXRT1180CCMState *s = IMXRT1180_CCM(dev);

    /*
     * An UNDER-FILLED mux table zero-fills, and enum 0 is CLK_OSC_RC_24M -- so a
     * row the generator missed would read as a perfectly plausible 24 MHz, which
     * is EXACTLY how six hardcoded timer defaults hid in this tree for months.
     * The generator did drop a row on its first pass (the last entry in
     * fsl_clock.c has no trailing comma).  So prove the far end is populated:
     * CKO2's mux2 is SYS_PLL1_DIV5, which no zero-fill can produce.
     */
    QEMU_BUILD_BUG_ON(ARRAY_SIZE(ccm_root_mux) != IMXRT1180_CCM_NROOT);
    assert(ccm_root_mux[IMXRT1180_CCM_NROOT - 1][2] == CLK_SYS_PLL1_DIV5);

    memory_region_init_io(&s->iomem, OBJECT(s), &imxrt1180_ccm_ops, s,
                          TYPE_IMXRT1180_CCM, IMXRT1180_CCM_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
}

static const VMStateDescription vmstate_imxrt1180_ccm = {
    .name = TYPE_IMXRT1180_CCM,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, IMXRT1180CCMState, IMXRT1180_CCM_SIZE / 4),
        VMSTATE_END_OF_LIST()
    },
};

static const Property imxrt1180_ccm_props[] = {
    DEFINE_PROP_LINK("anadig", IMXRT1180CCMState, anadig,
                     TYPE_IMXRT1180_ANADIG, IMXRT1180AnadigState *),
};

static void imxrt1180_ccm_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = imxrt1180_ccm_realize;
    device_class_set_legacy_reset(dc, imxrt1180_ccm_reset);
    dc->vmsd = &vmstate_imxrt1180_ccm;
    device_class_set_props(dc, imxrt1180_ccm_props);
}

static const TypeInfo imxrt1180_ccm_types[] = {
    {
        .name          = TYPE_IMXRT1180_CCM,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(IMXRT1180CCMState),
        .class_init    = imxrt1180_ccm_class_init,
    },
};

DEFINE_TYPES(imxrt1180_ccm_types)
